Revit 2024 API
ViewPrintedEventArgs Class
 The event arguments used by the ViewPrinted event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class ViewPrintedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class ViewPrintedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class ViewPrintedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewPrintedEventArgs
See Also
ViewPrintedEventArgs Members
Autodesk.Revit.DB.Events Namespace